{
  "presentation_title": "Freedom in the Spirit",
  "presentation_subtitle": "Biblical Verses on Spiritual Freedom",
  "sections": [
    {
      "section": "Freedom Through the Spirit",
      "verses": [
        {
          "reference": "2 Corinthians 3:17 (ESV)",
          "text": "Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom."
        },
        {
          "reference": "Acts 10:43 (ESV)",
          "text": "To him all the prophets bear witness that everyone who believes in him receives forgiveness of sins through his name."
        },
        {
          "reference": "Acts 10:44 (ESV)",
          "text": "While Peter was still saying these things, the Holy Spirit fell on all who heard the word."
        },
        {
          "reference": "Galatians 3:2 (ESV)",
          "text": "Did you receive the Spirit by works of the law or by hearing with faith?"
        },
        {
          "reference": "Galatians 3:5 (ESV)",
          "text": "Does he who supplies the Spirit to you and works miracles among you do so by works of the law, or by hearing with faith?"
        },
        {
          "reference": "John 8:31–32 (ESV)",
          "text": "If you abide in my word, you are truly my disciples, and you will know the truth, and the truth will set you free."
        },
        {
          "reference": "John 8:36 (ESV)",
          "text": "So if the Son sets you free, you will be free indeed."
        },
        {
          "reference": "Galatians 5:1 (ESV)",
          "text": "For freedom Christ has set us free; stand firm therefore, and do not submit again to a yoke of slavery."
        },
        {
          "reference": "Romans 8:1–2 (ESV)",
          "text": "There is therefore now no condemnation for those who are in Christ Jesus. For the law of the Spirit of life has set you free in Christ Jesus from the law of sin and death."
        },
        {
          "reference": "John 5:24 (ESV)",
          "text": "Truly, truly, I say to you, whoever hears my word and believes him who sent me has eternal life. He does not come into judgment, but has passed from death to life."
        }
      ]
    }
  ]
}
