{
    "presentation_title": "He became poor so we can become rich",
    "presentation_subtitle": "",
    "sections": [
        {
            "section": "Why We Should Be Rich",
            "verses": []
        },
        {
            "section": "1. Jesus Became Poor So We Might Become Rich",
            "verses": [
                {
                    "reference": "2 Corinthians 8:9 (NKJV)",
                    "text": "For you know the grace of our Lord Jesus Christ, that though He was rich, yet for your sakes He became poor, that you through His poverty might become rich.",
                    "highlights": [
                        "He was rich",
                        "He became poor",
                        "you through His poverty might become rich"
                    ]
                }
            ]
        },
        {
            "section": "2. Blessed to Be a Blessing (Abraham, Isaac, Jacob, Job)",
            "verses": [
                {
                    "reference": "Genesis 12:2–3 (NKJV)",
                    "text": "I will make you a great nation; I will bless you And make your name great; And you shall be a blessing. I will bless those who bless you, And I will curse him who curses you; And in you all the families of the earth shall be blessed.",
                    "highlights": [
                        "I will bless you",
                        "you shall be a blessing",
                        "all the families of the earth shall be blessed"
                    ]
                },
                {
                    "reference": "Genesis 13:2 (NKJV)",
                    "text": "Abram was very rich in livestock, in silver, and in gold.",
                    "highlights": [
                        "very rich"
                    ]
                },
                {
                    "reference": "Genesis 13:6 (NKJV)",
                    "text": "Now the land was not able to support them, that they might dwell together, for their possessions were so great that they could not dwell together.",
                    "highlights": [
                        "their possessions were so great"
                    ]
                },
                {
                    "reference": "Genesis 26:12–14 (NKJV)",
                    "text": "Then Isaac sowed in that land, and reaped in the same year a hundredfold; and the Lord blessed him. The man began to prosper, and continued prospering until he became very prosperous; for he had possessions of flocks and possessions of herds and a great number of servants. So the Philistines envied him.",
                    "highlights": [
                        "a hundredfold",
                        "the Lord blessed him",
                        "became very prosperous"
                    ]
                },
                {
                    "reference": "Genesis 30:43 (NKJV)",
                    "text": "Thus the man became exceedingly prosperous, and had large flocks, female and male servants, and camels and donkeys.",
                    "highlights": [
                        "exceedingly prosperous"
                    ]
                },
                {
                    "reference": "Job 42:12 (NKJV)",
                    "text": "Now the Lord blessed the latter days of Job more than his beginning; for he had fourteen thousand sheep, six thousand camels, one thousand yoke of oxen, and one thousand female donkeys.",
                    "highlights": [
                        "the Lord blessed the latter days of Job more than his beginning"
                    ]
                }
            ]
        },
        {
            "section": "3. Money Answers Everything",
            "verses": [
                {
                    "reference": "Ecclesiastes 10:19 (NKJV)",
                    "text": "A feast is made for laughter, And wine makes merry; But money answers everything.",
                    "highlights": [
                        "money answers everything"
                    ]
                }
            ]
        },
        {
            "section": "4. Prosperity as a Sign That Brings Belief",
            "verses": [
                {
                    "reference": "Genesis 26:28 (NKJV)",
                    "text": "But they said, \"We have certainly seen that the Lord is with you. So we said, 'Let there now be an oath between us, between you and us; and let us make a covenant with you,",
                    "highlights": [
                        "the Lord is with you"
                    ]
                },
                {
                    "reference": "Genesis 39:3 (NKJV)",
                    "text": "And his master saw that the Lord was with him and that the Lord made all he did to prosper in his hand.",
                    "highlights": [
                        "the Lord was with him",
                        "prosper in his hand"
                    ]
                },
                {
                    "reference": "Genesis 45:26–28 (NKJV)",
                    "text": "And they told him, saying, \"Joseph is still alive, and he is governor over all the land of Egypt.\" And Jacob's heart stood still, because he did not believe them. But when they told him all the words which Joseph had said to them, and when he saw the carts which Joseph had sent to carry him, the spirit of Jacob their father revived. Then Israel said, \"It is enough. Joseph my son is still alive. I will go and see him before I die.\"",
                    "highlights": [
                        "Joseph is still alive",
                        "he is governor over all the land of Egypt",
                        "the spirit of Jacob their father revived"
                    ]
                },
                {
                    "reference": "Psalm 67:1–2 (NKJV)",
                    "text": "God be merciful to us and bless us, And cause His face to shine upon us, Selah That Your way may be known on earth, Your salvation among all nations.",
                    "highlights": [
                        "bless us",
                        "Your way may be known on earth"
                    ]
                }
            ]
        },
        {
            "section": "How to Become Rich?",
            "verses": []
        },
        {
            "section": "1. Tithe",
            "verses": [
                {
                    "reference": "",
                    "text": "מַעֲשֵׂר (maʿăśēr) – tithe, tenth part\n\nעָשַׁר (ʿāšar) – to be or become rich, to make rich",
                    "highlights": [
                        "מַעֲשֵׂר",
                        "עָשַׁר"
                    ],
                    "large_text": {
                        "מַעֲשֵׂר": 200,
                        "עָשַׁר": 200
                    }
                },
                {
                    "reference": "Malachi 3:10 (NKJV)",
                    "text": "Bring all the tithes into the storehouse, That there may be food in My house, And try Me now in this,\" Says the Lord of hosts, \"If I will not open for you the windows of heaven And pour out for you such blessing That there will not be room enough to receive it.",
                    "highlights": [
                        "Bring all the tithes into the storehouse",
                        "open for you the windows of heaven",
                        "pour out for you such blessing"
                    ]
                },
                {
                    "reference": "Proverbs 3:9–10 (NKJV)",
                    "text": "Honor the Lord with your possessions, And with the firstfruits of all your increase; So your barns will be filled with plenty, And your vats will overflow with new wine.",
                    "highlights": [
                        "Honor the Lord with your possessions",
                        "your barns will be filled with plenty"
                    ]
                },
                {
                    "reference": "Deuteronomy 8:18 (NKJV)",
                    "text": "And you shall remember the Lord your God, for it is He who gives you power to get wealth, that He may establish His covenant which He swore to your fathers, as it is this day.",
                    "highlights": [
                        "He who gives you power to get wealth"
                    ]
                }
            ]
        },
        {
            "section": "2. Sow Sparingly, Reap Sparingly — Sow Bountifully",
            "verses": [
                {
                    "reference": "2 Corinthians 9:6 (NKJV)",
                    "text": "But this I say: He who sows sparingly will also reap sparingly, and he who sows bountifully will also reap bountifully.",
                    "highlights": [
                        "sows sparingly will also reap sparingly",
                        "sows bountifully will also reap bountifully"
                    ]
                },
                {
                    "reference": "2 Corinthians 9:8 (NKJV)",
                    "text": "And God is able to make all grace abound toward you, that you, always having all sufficiency in all things, may have an abundance for every good work.",
                    "highlights": [
                        "all grace abound toward you",
                        "all sufficiency in all things"
                    ]
                },
                {
                    "reference": "Luke 6:38 (NKJV)",
                    "text": "Give, and it will be given to you: good measure, pressed down, shaken together, and running over will be put into your bosom. For with the same measure that you use, it will be measured back to you.",
                    "highlights": [
                        "Give, and it will be given to you",
                        "good measure, pressed down, shaken together, and running over"
                    ]
                }
            ]
        },
        {
            "section": "Benefits of Tithing / Offering",
            "verses": []
        },
        {
            "section": "1. To Prove That Jesus Is Alive (Melchizedek)",
            "verses": [
                {
                    "reference": "Hebrews 7:8 (NKJV)",
                    "text": "Here mortal men receive tithes, but there he receives them, of whom it is witnessed that he lives.",
                    "highlights": [
                        "he receives them",
                        "he lives"
                    ]
                },
                {
                    "reference": "Genesis 14:18–20 (NKJV)",
                    "text": "Then Melchizedek king of Salem brought out bread and wine; he was the priest of God Most High. And he blessed him and said: \"Blessed be Abram of God Most High, Possessor of heaven and earth; And blessed be God Most High, Who has delivered your enemies into your hand.\" And he gave him a tithe of all.",
                    "highlights": [
                        "Melchizedek",
                        "priest of God Most High",
                        "he gave him a tithe of all"
                    ]
                }
            ]
        },
        {
            "section": "2. To Show That God Is the One Who Made You Rich",
            "verses": [
                {
                    "reference": "Genesis 14:22–23 (NKJV)",
                    "text": "But Abram said to the king of Sodom, \"I have raised my hand to the Lord, God Most High, the Possessor of heaven and earth, that I will take nothing, from a thread to a sandal strap, and that I will not take anything that is yours, lest you should say, 'I have made Abram rich'—",
                    "highlights": [
                        "the Possessor of heaven and earth",
                        "I have made Abram rich"
                    ]
                }
            ]
        },
        {
            "section": "3. By Faith Abel Offered",
            "verses": [
                {
                    "reference": "Hebrews 11:4 (NKJV)",
                    "text": "By faith Abel offered to God a more excellent sacrifice than Cain, through which he obtained witness that he was righteous, God testifying of his gifts; and through it he being dead still speaks.",
                    "highlights": [
                        "By faith Abel offered",
                        "a more excellent sacrifice",
                        "he being dead still speaks"
                    ]
                }
            ]
        },
        {
            "section": "4. To Find Where Your Heart Is",
            "verses": [
                {
                    "reference": "Matthew 6:21 (NKJV)",
                    "text": "For where your treasure is, there your heart will be also.",
                    "highlights": [
                        "where your treasure is, there your heart will be also"
                    ]
                },
                {
                    "reference": "Mark 12:41–44 (NKJV) - Part 1",
                    "text": "Now Jesus sat opposite the treasury and saw how the people put money into the treasury. And many who were rich put in much. Then one poor widow came and threw in two mites, which make a quadrans.",
                    "highlights": [
                        "saw how the people put money",
                        "one poor widow",
                        "two mites"
                    ]
                },
                {
                    "reference": "Mark 12:41–44 (NKJV) - Part 2",
                    "text": "So He called His disciples to Himself and said to them, \"Assuredly, I say to you that this poor widow has put in more than all those who have given to the treasury; for they all put in out of their abundance, but she out of her poverty put in all that she had, her whole livelihood.\"",
                    "highlights": [
                        "this poor widow has put in more",
                        "she out of her poverty put in all that she had"
                    ]
                }
            ]
        },
        {
            "section": "5. Honor God With Your Money",
            "verses": [
                {
                    "reference": "Proverbs 3:9–10 (NKJV)",
                    "text": "Honor the Lord with your possessions, And with the firstfruits of all your increase; So your barns will be filled with plenty, And your vats will overflow with new wine.",
                    "highlights": [
                        "Honor the Lord with your possessions",
                        "firstfruits of all your increase"
                    ]
                }
            ]
        },
        {
            "section": "6. To Come Out of Debt (Elisha and the Widow)",
            "verses": [
                {
                    "reference": "2 Kings 4:6–7 (NKJV)",
                    "text": "Now it came to pass, when the vessels were full, that she said to her son, \"Bring me another vessel.\" And he said to her, \"There is not another vessel.\" So the oil ceased. Then she came and told the man of God. And he said, \"Go, sell the oil and pay your debt; and you and your sons live on the rest.\"",
                    "highlights": [
                        "the vessels were full",
                        "Go, sell the oil and pay your debt"
                    ]
                }
            ]
        },
        {
            "section": "General Questions",
            "verses": []
        },
        {
            "section": "1. Tithing Is For Who? (Milk vs Strong Meat)",
            "verses": [
                {
                    "reference": "1 Corinthians 3:1–2 (NKJV)",
                    "text": "And I, brethren, could not speak to you as to spiritual people but as to carnal, as to babes in Christ. I fed you with milk and not with solid food; for until now you were not able to receive it, and even now you are still not able;",
                    "highlights": [
                        "babes in Christ",
                        "milk and not with solid food"
                    ]
                },
                {
                    "reference": "Hebrews 5:13–14 (NKJV)",
                    "text": "For everyone who partakes only of milk is unskilled in the word of righteousness, for he is a babe. But solid food belongs to those who are of full age, that is, those who by reason of use have their senses exercised to discern both good and evil.",
                    "highlights": [
                        "solid food belongs to those who are of full age"
                    ]
                }
            ]
        },
        {
            "section": "2. Money Is the Root of All Evil?",
            "verses": [
                {
                    "reference": "1 Timothy 6:10 (NKJV)",
                    "text": "For the love of money is a root of all kinds of evil, for which some have strayed from the faith in their greediness, and pierced themselves through with many sorrows.",
                    "highlights": [
                        "the love of money"
                    ]
                }
            ]
        },
        {
            "section": "3. Shouldn't I Be Content With What I Have?",
            "verses": [
                {
                    "reference": "1 Timothy 6:6–8 (NKJV)",
                    "text": "Now godliness with contentment is great gain. For we brought nothing into this world, and it is certain we can carry nothing out. And having food and clothing, with these we shall be content.",
                    "highlights": [
                        "godliness with contentment is great gain"
                    ]
                },
                {
                    "reference": "1 Timothy 6:9–10 (NKJV)",
                    "text": "But those who desire to be rich fall into temptation and a snare, and into many foolish and harmful lusts which drown men in destruction and perdition. For the love of money is a root of all kinds of evil, for which some have strayed from the faith in their greediness, and pierced themselves through with many sorrows.",
                    "highlights": [
                        "the love of money is a root of all kinds of evil"
                    ]
                },
                {
                    "reference": "1 Timothy 6:17–19 (NKJV)",
                    "text": "Command those who are rich in this present age not to be haughty, nor to trust in uncertain riches but in the living God, who gives us richly all things to enjoy. Let them do good, that they be rich in good works, ready to give, willing to share, storing up for themselves a good foundation for the time to come, that they may lay hold on eternal life.",
                    "highlights": [
                        "the living God, who gives us richly all things to enjoy",
                        "rich in good works",
                        "lay hold on eternal life"
                    ]
                }
            ]
        },
        {
            "section": "4. Where Should I Give Tithe?",
            "verses": [
                {
                    "reference": "Malachi 3:10 (NKJV)",
                    "text": "Bring all the tithes into the storehouse, That there may be food in My house, And try Me now in this,\" Says the Lord of hosts, \"If I will not open for you the windows of heaven And pour out for you such blessing That there will not be room enough to receive it.",
                    "highlights": [
                        "tithes into the storehouse",
                        "open for you the windows of heaven"
                    ]
                },
                {
                    "reference": "Galatians 6:6–7 (NKJV)",
                    "text": "Let him who is taught the word share in all good things with him who teaches. Do not be deceived, God is not mocked; for whatever a man sows, that he will also reap.",
                    "highlights": [
                        "him who teaches",
                        "whatever a man sows, that he will also reap"
                    ]
                },
                {
                    "reference": "Hebrews 7:8 (NKJV)",
                    "text": "Here mortal men receive tithes, but there he receives them, of whom it is witnessed that he lives.",
                    "highlights": [
                        "he receives them",
                        "he lives"
                    ]
                },
                {
                    "reference": "Matthew 13:23 (NKJV)",
                    "text": "But he who received seed on the good ground is he who hears the word and understands it, who indeed bears fruit and produces: some a hundredfold, some sixty, some thirty.",
                    "highlights": [
                        "good ground",
                        "bears fruit",
                        "a hundredfold"
                    ]
                }
            ]
        }
    ]
}